using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Web.UI;
using System.Web.UI.WebControls;

namespace AMC_EGRS.citizen
{
    public partial class WebForm2 : System.Web.UI.Page
    {
        protected void Page_Load(object sender, EventArgs e)
        {
            if (Request.QueryString["Logout"] == "User")
            {
                Session.Abandon();
                Session.Clear();
                
            }
            String h2msg = "ईजीआरएस एक वेब आधारित उद्यम समाधान है जो नगर पालिका/निगम को व्यापक सेवा प्रबंधन और कुशल सेवा वितरण के माध्यम से नागरिक संतुष्टि को बढ़ाने की अनुमति देता है।ईजीआरएस पंजीकरण से लेकर बंद करने तक पूरी शिकायत प्रक्रिया को स्वचालित करता है। यह सेवा स्तर की नीतियों को भी लागू करता है ताकि यह सुनिश्चित किया जा सके कि शिकायत वांछित समय सीमा के भीतर हो या उनके ध्यान और हस्तक्षेप के लिए उच्च अधिकारियों तक पहुंच जाए। <br /><br />";
            h2msg += "नागरिक कॉल सेंटर, वेबसाइट या वार्ड कार्यालय में जाकर शिकायत दर्ज करा सकते हैं। कॉल सेंटर या वार्ड कार्यालय में, एक ऑपरेटर सभी आवश्यक विवरणों के साथ सिस्टम के भीतर शिकायत दर्ज करता है। शिकायतकर्ता एक कॉल के दौरान एकल या एकाधिक शिकायतें दर्ज करा सकता है। सभी मामलों में, शिकायतकर्ता को एक शिकायत पावती संख्या दी जाती है। <br /><br />";
            h2msg += "एक बार सिस्टम के भीतर शिकायत दर्ज हो जाने के बाद, यह रिपोर्ट की गई समस्या से निपटने वाले संबंधित क्षेत्र के अधिकारी को सौंपा जाता है। सिस्टम स्वचालित रूप से आवश्यक कार्रवाई करने के लिए शिकायत पर उसे सचेत करने वाले अधिकारी को एक एसएमएस भेजता है। यदि आवश्यक हो तो अधिकारी शिकायतकर्ता को विशिष्ट विवरण प्राप्त करने के लिए बुलाता है। <br /><br />";
            h2msg += "अधिकारी से एक निर्दिष्ट अवधि के भीतर शिकायत का समाधान करने की अपेक्षा की जाती है। एक बार शिकायत का समाधान हो जाने के बाद, अधिकारी शिकायत को सिस्टम में बंद के रूप में चिह्नित करता है। नागरिक को उसकी शिकायत के समाधान की पुष्टि करने वाला एक एसएमएस प्राप्त होता है। यदि नागरिक संतुष्ट नहीं है तो वह शिकायत को फिर से खोलने का अनुरोध कर सकता है, जिसे बाद में उच्च अधिकारी के पास भेज दिया जाता है।<br /><br />";
            h2msg += "यदि शिकायत का समाधान नहीं किया जाता है और निर्दिष्ट अवधि के भीतर बंद कर दिया जाता है, तो इसे उच्च अधिकारियों के पास भेज दिया जाता है। समस्या को हल करने में बार-बार विफल होने पर, यह डीई तक बढ़ जाता है। आयुक्त।<br /><br />";

            if (Request.QueryString["hindilan"] == "HINDI")
            {
                httag.InnerHtml = "ईजीआरएस के बारे में";
                httag.InnerText = "ईजीआरएस के बारे  में";
                spanp.Text = Server.HtmlDecode(h2msg);
                spanp.Text = Server.HtmlDecode(h2msg);
                spn2.Text = "<b>मुद्दे जिनके समाधान के लिए नहीं उठाया गया</b>";
                i1.Text = "न्यायाधीन मामले या किसी न्यायालय द्वारा दिए गए निर्णय से संबंधित कोई मामला।";
                i2.Text = "व्यक्तिगत और पारिवारिक विवाद।";
                i3.Text = "आरटीआई मायने रखता है।";
                i4.Text = "कुछ भी जो देश की क्षेत्रीय अखंडता या अन्य देशों के साथ मैत्रीपूर्ण संबंधों को प्रभावित करता है।";
                i5.Text = "सुझाव।";
                //left panel benefits part
                leftpanellan.InnerText = "ईजीआरएस के लाभ";
                leftpanellan.InnerHtml = "ईजीआरएस के लाभ";
                lp1.Text = "नागरिकों को शिकायत दर्ज कराने के लिए वार्ड कार्यालयों में जाने की जरूरत नहीं है";
                lp2.Text = "चौबीसों घंटे उपलब्ध प्रणाली - कॉल सेंटर, वेबसाइट, एसएमएस, ईमेल, आईवीआर, वार्ड कार्यालय, मोबाइल एप्लिकेशन";
                lp3.Text = "एसएमएस / ईमेल अलर्ट के माध्यम से बेहतर संचार ";
                lp4.Text = "ईजीआरएस प्रत्येक प्रकार की समस्या के लिए लगातार शिकायतों और औसत टर्नअराउंड समय का डेटा प्रदान करता है। यह नगर पालिका / निगम को जनशक्ति और बुनियादी ढांचे को बढ़ाकर सेवाओं में सुधार के लिए क्षेत्रों पर ध्यान केंद्रित करने में मदद करता है। इससे नगर पालिका/निगम को उनकी सेवाओं को प्राथमिकता देने में भी मदद मिलती है।";

                // Center
                center.InnerHtml = "शिकायत कैसे दर्ज करें";
                center.InnerText = "शिकायत कैसे दर्ज करें";
                c1.Text = "एक नागरिक कॉल सेंटर, वार्ड कार्यालय या वेबसाइट के माध्यम से शिकायत दर्ज कर सकता है";
                c2.Text = "<b>वेबसाइट के माध्यम से ऑनलाइन शिकायत दर्ज करने के लिए:</b>";
                c3.Text = "शिकायत पंजीकरण के “ऑनलाइन” विकल्प पर क्लिक करें और अपनी शिकायत का विवरण दर्ज करें।";
                ce4.Text = "<b>कॉल सेंटर के रूप में शिकायत दर्ज कराने के लिए</b>";
                ce5.Text = "शिकायत करने के लिए 24*7 के बीच लैंडलाइन या मोबाइल से 155303 डायल करके हमारे समर्पित कॉल सेंटर से संपर्क करें। नगर पालिका/निगम निर्बाध सहायता प्रदान करने का आश्वासन देता है।";
                ce6.Text = "<b>ई-मेल के माध्यम से शिकायत दर्ज करने के लिए</b>";
                ce7.Text = "अपना ईमेल नाम, मोबाइल नंबर, समाधान की समस्या और स्थान जहां समस्या <b>amcegrsahmd @gmail.com</b> पर भेजें, कॉल ऑपरेटर ईमेल की जांच करेगा और सिस्टम में शिकायत दर्ज करेगा। यदि प्रदान की गई जानकारी अपर्याप्त है या किसी स्पष्टीकरण की आवश्यकता है, तो ऑपरेटर नागरिक से संपर्क कर सकता है।";

                //center under
                centerunder.InnerText = "आईवीआर के माध्यम से शिकायत दर्ज करने के लिए:";
                centerunder.InnerHtml = "आईवीआर के माध्यम से शिकायत दर्ज करने के लिए:";
                cu1.Text = "<b>नागरिक आईवीआर के माध्यम से गैर-कार्य घंटों के दौरान या जब सभी ऑपरेटर शिकायतों पर ध्यान देने में व्यस्त हों, शिकायत दर्ज कर सकते हैं।</b>";
                cu2.Text = "<b>चरण - 1 </b>: भाषा चुनें - गुजराती के लिए 1 दबाएं, अंग्रेजी के लिए 2 या हिंदी के लिए 3 दबाएं";
                cu3.Text = "<b>चरण - 2 </b>: IVR जारी रखने के लिए 1 दबाएं या कॉलबैक के लिए 2 दबाएं press";
                cu4.Text = "<b>चरण - 3 </b>: अपना नाम बताएं और # दबाएं";
                cu5.Text = "<b>चरण - 4 </b>: अपना मोबाइल नंबर बताएं और # दबाएं";
                cu6.Text = "<b>चरण - 5 </b>: अपनी समस्या को हल करने के लिए कहें और # दबाएं";
                cu7.Text = "<b>चरण - 6 </b>: अपना स्थान पता बताएं कि समस्या कहां है और # दबाएं";
                cu8.Text = "कॉल सेंटर संचालक आईवीआर दर्ज की गई शिकायत को सुनेगा और उसे सिस्टम में दर्ज करेगा। यदि प्रदान की गई जानकारी अपर्याप्त है या किसी स्पष्टीकरण की आवश्यकता है तो वह नागरिक से संपर्क कर सकता है।";

                //footer start 
                footerlan.InnerHtml = "शिकायत को फिर से खोलना";
                footerlan.InnerText = "शिकायत को फिर से खोलना";
                f1.Text = "हमारी पिछली प्रतिक्रिया से संतुष्ट नहीं हैं?";
                f2.Text = "<b>ई - मेल के माध्यम से शिकायत फिर से खोलें: </b>";
                f3.Text = " <b>ccrs @ahmedabadcity.gov.in</b> पर मोबाइल नंबर, टोकन नंबर और फिर से खोलने का कारण के साथ अपना ईमेल भेजें, कॉल ऑपरेटर ईमेल की जांच करेगा और सिस्टम में शिकायत को फिर से खोलेगा। यदि प्रदान की गई जानकारी अपर्याप्त है या किसी स्पष्टीकरण की आवश्यकता है तो ऑपरेटर नागरिक से संपर्क कर सकता है।";
                f4.Text = "<b>लॉग इन रजिस्टर करें</b>";
                f5.Text = "<b>स्थिति देखें</b>";
                f6.Text = "<b>संपर्क करें</b>";
                currentstatus.Text = "ईमेल द्वा भेजी गई किसी भी शिकायत पर ध्यान नहीं दिया जाएगा/मनोरंजन नहीं किया जाएगा। कृपया वेबसाइट पर अपनी शिकायत दर्ज करें।";

            }
            

        }
    }
}